Tekla Open API Reference for Tekla Structures 2025
IEvents.ViewCameraChanged Event
 Occurs when view camera is changed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.ViewCameraChangedDelegate ViewCameraChanged
Event ViewCameraChanged As Events.ViewCameraChangedDelegate
Value
Type: Tekla.Structures.Model.Events.ViewCameraChangedDelegate
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace